In [6]:
##Task1:Funtion get all info about data

In [ ]:
import pandas as pd

In [4]:
def analysis(path):
        if path.endswith(".csv"):
            df = pd.read_csv(path)
        elif path.endswith((".xlsx", ".xls")):
            df = pd.read_excel(path)
        else:
            print("Unsupported file.")
            return
        print(df.describe())
        print(df.info())
        print(df.isnull().sum())
        return df

In [5]:
df=analysis("weather_data_replace.csv")

        temperature     windspeed
count      7.000000      7.000000
mean  -28548.714286 -28567.285714
std    48809.837361  48797.150657
min   -99999.000000 -99999.000000
25%   -49985.500000 -49998.500000
50%       31.000000      5.000000
75%       32.000000      6.500000
max       34.000000      7.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          7 non-null      object
 1   temperature  7 non-null      int64
 2   windspeed    7 non-null      int64
 3   event        7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes
None
day            0
temperature    0
windspeed      0
event          0
dtype: int64

In [13]:
##Task2:merge more than 2 data frames

In [8]:
df5=pd.DataFrame({
    "catagory":["egg","rice","milk"],
    "qantity":[20,40,60]
})
df5

  catagory  qantity
0      egg       20
1     rice       40
2     milk       60

In [9]:
df6=pd.DataFrame({
    "catagory":["egg","rice","milk","bread","salat"],
    "price":[20,40,60,5,96]
})
df6

  catagory  price
0      egg     20
1     rice     40
2     milk     60
3    bread      5
4    salat     96

In [10]:
df7=pd.DataFrame({
    "catagory":["egg","rice","milk","bread","salat","chaease"],
    "number":[20,40,60,5,96,10]
})
df7

  catagory  number
0      egg      20
1     rice      40
2     milk      60
3    bread       5
4    salat      96
5  chaease      10

In [11]:
result=pd.merge(df5,df6,on="catagory",how="outer",)
result1=pd.merge(df5,result,on="catagory",how="outer",)
result1

  catagory  qantity_x  qantity_y  price
0      egg       20.0       20.0     20
1     rice       40.0       40.0     40
2     milk       60.0       60.0     60
3    bread        NaN        NaN      5
4    salat        NaN        NaN     96

In [18]:
##Task3:tools for data anlysis

##Apache Hadoop
##Apache Spark
##Power BI / Tableau
##Google BigQuery